<a href="https://colab.research.google.com/github/obizoba/BIZI/blob/master/CA2%20ASSIGNMENT%20OBIZOBA%20ILOABACHIE%20JOSEPH%20%5B10555563%5D.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

#ETL (Extract, Transform, Load) Technique on FireBrigadeAndAmbulanceCallOuts.csv

##[1] Load the CSV file (using Python).

In [5]:
import pandas as pd#importing panda libery
import numpy as np#importing numpy libery 
FireBrigade = pd.read_csv("FireBrigadeAndAmbulanceCallOuts (1) (1).csv")#Loading the CSV file and establishing path way(using Python).
print(f"Here is the details of the dataset:\n{FireBrigade}")#Showing complete view of the data.
FireBrigade.head(21)#showing the first 20 rows in the dataset.

Here is the details of the dataset:
             Date    Station Area   Description  ...        AH       MAV        CD
0      01/01/2013     Rathfarnham     S/S OTHER  ...  02:28:54  02:48:54  03:08:54
1      01/01/2013        Tallaght      Fire CAR  ...  02:25:43  02:45:43  03:05:43
2      01/01/2013    North Strand       S/S RTA  ...  04:11:20  04:31:20  04:51:20
3      01/01/2013        Tallaght      Fire CAR  ...  04:50:48  05:10:48  05:30:48
4      01/01/2013         Finglas  Fire DOM PER  ...  04:50:47  05:10:47  05:30:47
...           ...             ...           ...  ...       ...       ...       ...
38551  28/04/2018  Blanchardstown    Fire ALARM  ...       NaN  00:20:00  00:40:00
38552  09/10/2018      Kilbarrack      Fire CAR  ...       NaN  00:20:00  00:40:00
38553  07/06/2018        Skerries    Fire SMALL  ...       NaN         -         -
38554  21/11/2018      Donnybrook    Fire ALARM  ...       NaN         -         -
38555  01/01/2019      Kilbarrack    Fire ALARM  ...       NaN         -         -

[38556 rows x 11 columns]

          Date    Station Area    Description  ...        AH       MAV        CD
0   01/01/2013     Rathfarnham      S/S OTHER  ...  02:28:54  02:48:54  03:08:54
1   01/01/2013        Tallaght       Fire CAR  ...  02:25:43  02:45:43  03:05:43
2   01/01/2013    North Strand        S/S RTA  ...  04:11:20  04:31:20  04:51:20
3   01/01/2013        Tallaght       Fire CAR  ...  04:50:48  05:10:48  05:30:48
4   01/01/2013         Finglas   Fire DOM PER  ...  04:50:47  05:10:47  05:30:47
5   01/01/2013        Tallaght      S/S OTHER  ...  05:39:48  05:59:48  06:19:48
6   01/01/2013   Dun Laoghaire     Fire ALARM  ...  05:55:13  06:15:13  06:35:13
7   01/01/2013         Tara St     Fire ALARM  ...  00:30:00  00:50:00  01:10:00
8   01/01/2013      Balbriggan     Fire ALARM  ...  06:40:10  07:00:10  07:20:10
9   01/01/2013      Kilbarrack     Fire ALARM  ...  06:43:47  07:03:47  07:23:47
10  01/01/2013   Dolphins Barn     S/S GRDASS  ...  07:02:39  07:22:39  07:42:39
11  01/01/2013         Tara St  Fire HIGHRISE  ...  08:22:22  08:42:22  09:02:22
12  01/01/2013  Blanchardstown       Fire CAR  ...  08:46:20  09:06:20  09:26:20
13  01/01/2013      Kilbarrack       Fire CAR  ...  10:14:22  10:34:22  10:54:22
14  01/01/2013      Balbriggan       Fire CAR  ...  13:14:18  13:34:18  13:54:18
15  01/01/2013   Dun Laoghaire   Fire CHIMNEY  ...  00:30:00  00:50:00  01:10:00
16  01/01/2013        Tallaght        S/S RTA  ...  14:20:35  14:40:35  15:00:35
17  01/01/2013      Kilbarrack      S/S OTHER  ...  15:32:47  15:52:47  16:12:47
18  01/01/2013        Tallaght  Fire DOMESTIC  ...  15:48:37  16:08:37  16:28:37
19  01/01/2013        Tallaght  Fire DOMESTIC  ...  15:52:52  16:12:52  16:32:52
20  01/01/2013        Tallaght      Fire FIRE  ...  16:38:27  16:58:27  17:18:27

[21 rows x 11 columns]

##[2] Output the total number of rows and columns.

In [6]:
print(f"The total number of rows and columns in the dataset are:\n{FireBrigade.shape}.")#Outputing the total number of rows and columns of the dataset.

The total number of rows and columns in the dataset are:
(38556, 11).

##[3] Output the number of non-null rows (by column).

In [7]:
print(f"The output for null-null rows is:\n{FireBrigade.count()}")#Outputing the number of non-null rows (by column).

The output for null-null rows is:
Date            38556
Station Area    38556
Description     38556
TOC             38556
ORD             38556
MOB             37311
IA              30962
LS              38556
AH                153
MAV             38530
CD              38530
dtype: int64

##[4] Output the number of null values (by column).

In [8]:
print(f"The number of null values in the dataset is:\n{FireBrigade.isnull().sum()}")#Outputing the number of null values (by column).

The number of null values in the dataset is:
Date                0
Station Area        0
Description         0
TOC                 0
ORD                 0
MOB              1245
IA               7594
LS                  0
AH              38403
MAV                26
CD                 26
dtype: int64

##[5] Output the number of null values for all columns

In [9]:
print(f"The number of null values for all columns is:\n{FireBrigade.isnull().sum().sum()}")#To get the number of null values, we re-sum the number of null values in (question 4) to get for all columns.

The number of null values for all columns is:
47294

##[6] Output the total number of call outs by Station Area.

In [10]:
print(f"Total number of callout by Station Area is:\n{FireBrigade.groupby('Station Area').Date.agg(['count'])}")#showing total call out by station Area by using the "groupby method".

Total number of callout by Station Area is:
                count
Station Area
Balbriggan        688
Blanchardstown   2089
Dolphins Barn    4018
Donnybrook       1787
Dun Laoghaire    3271
Dunshaughlin        2
Finglas          3030
Kilbarrack       3548
MH14                1
North Strand     1645
Phibsborough     3160
Rathfarnham      2129
Skerries          449
Swords           2614
Tallaght         6525
Tara St          3600

##[7] Output the total number of call outs by Date and Station Area.

In [11]:
print(f"The Total number of call outs by date and Station Area is:\n {FireBrigade.groupby(['Station Area','Date']).TOC.agg(['count'])}")#sorting call out by date and Station Area.

The Total number of call outs by date and Station Area is:
                          count
Station Area Date
Balbriggan   01/01/2013      3
             01/01/2014      1
             01/02/2014      2
             01/03/2013      1
             01/03/2014      1
...                        ...
Tara St      31/10/2013      9
             31/10/2014     11
             31/10/2015      5
             31/12/2013      4
             31/12/2014      3

[12483 rows x 1 columns]

##[8] Output the total number of call outs by Station Area and Date where the description is either Fire Car or Fire Alarm.

In [12]:
print(f"Sorting Total number of call outs by station Area and Date:\n{FireBrigade[(FireBrigade.Description == 'Fire CAR')|(FireBrigade.Description == 'Fire ALARM')].groupby(['Station Area','Date']).TOC.agg(['count'])}")#

Sorting Total number of call outs by station Area and Date:
                         count
Station Area Date
Balbriggan   01/01/2013      3
             01/01/2014      1
             01/04/2013      1
             01/05/2013      1
             01/11/2015      1
...                        ...
Tara St      31/07/2015      2
             31/08/2013      1
             31/10/2014      2
             31/10/2015      2
             31/12/2013      1

[6792 rows x 1 columns]

##[9] Replace any instance of “,” (in any column) with an empty string.

In [13]:
if_comma_is = ',' in FireBrigade.values#Here, we are making a statement to check if there is ','.
FireBrigade = FireBrigade.replace(',','')#We intende to replace ',' with ''.
if_comma_is = ',' in FireBrigade.values#last tesing to comfirm our results if its true or fales.
print(f"Here is our confirmation:\n{if_comma_is}.")

Here is our confirmation:
False.

##[10] Replace any instance of “-” (in any column) with an empty string.

In [14]:
if_dash_is = ',' in FireBrigade.values#Here,we repeat the same process in (question 9)by making a statement to check if there is '-'.
FireBrigade = FireBrigade.replace('-','')#we intend to replace '-' with ''.
if_dash_is = '-' in FireBrigade.values# finally testing if our result is true or false
print(f"Here is our confirmation:\n{if_dash_is}.")

Here is our confirmation:
False.

##[11] Drop rows for the columns (AH, MAV, CD) where at least one row value is NULL.

In [15]:
FireBrigade = FireBrigade.dropna(subset=['AH', 'MAV','CD'])#Dropping rows with nulls.
print(f"Here are the rows that are dropped due to removed null:\n{FireBrigade}")#viewing the dataset after removal of nulls.
print(f"Here are the total number of rows after Null removal:\n{FireBrigade.shape[0]}")#showing the number of rows by setting shape to 0.

Here are the rows that are dropped due to removed null:
             Date    Station Area   Description  ...        AH       MAV        CD
0      01/01/2013     Rathfarnham     S/S OTHER  ...  02:28:54  02:48:54  03:08:54
1      01/01/2013        Tallaght      Fire CAR  ...  02:25:43  02:45:43  03:05:43
2      01/01/2013    North Strand       S/S RTA  ...  04:11:20  04:31:20  04:51:20
3      01/01/2013        Tallaght      Fire CAR  ...  04:50:48  05:10:48  05:30:48
4      01/01/2013         Finglas  Fire DOM PER  ...  04:50:47  05:10:47  05:30:47
...           ...             ...           ...  ...       ...       ...       ...
38490  16/10/2015        Tallaght    Fire SMALL  ...            00:20:00  00:40:00
38491  13/08/2015        Tallaght    Fire GRASS  ...            00:20:00  00:40:00
38496  23/06/2015         Finglas    Fire SMALL  ...            00:20:00  00:40:00
38497  23/12/2015   Dun Laoghaire    S/S TREEDN  ...            00:20:00  00:40:00
38500  30/09/2015  Blanchardstown    Fire SMALL  ...            00:20:00  00:40:00

[153 rows x 11 columns]
Here are the total number of rows after Null removal:
153

##[12] Drop any duplicate rows (except for the first occurrence).

In [16]:
print(f"Here is the data with dupicates dropped:\n{FireBrigade.drop_duplicates(keep='first')}")#Removal of Dupicated rows but keeping only the First occurance.
FireBrigade = FireBrigade.drop_duplicates(keep='first')
print(f"This is new row number:\n{FireBrigade.shape[0]}")#showing New Row number after removal of dulpicate.

Here is the data with dupicates dropped:
             Date    Station Area   Description  ...        AH       MAV        CD
0      01/01/2013     Rathfarnham     S/S OTHER  ...  02:28:54  02:48:54  03:08:54
1      01/01/2013        Tallaght      Fire CAR  ...  02:25:43  02:45:43  03:05:43
2      01/01/2013    North Strand       S/S RTA  ...  04:11:20  04:31:20  04:51:20
3      01/01/2013        Tallaght      Fire CAR  ...  04:50:48  05:10:48  05:30:48
4      01/01/2013         Finglas  Fire DOM PER  ...  04:50:47  05:10:47  05:30:47
...           ...             ...           ...  ...       ...       ...       ...
38490  16/10/2015        Tallaght    Fire SMALL  ...            00:20:00  00:40:00
38491  13/08/2015        Tallaght    Fire GRASS  ...            00:20:00  00:40:00
38496  23/06/2015         Finglas    Fire SMALL  ...            00:20:00  00:40:00
38497  23/12/2015   Dun Laoghaire    S/S TREEDN  ...            00:20:00  00:40:00
38500  30/09/2015  Blanchardstown    Fire SMALL  ...            00:20:00  00:40:00

[152 rows x 11 columns]
This is new row number:
152

##[13] Output the minimum time difference between TOC and ORD.

In [17]:
#we can not calculate the time differnce by subtracting "TOC" and "ORD" because it will give an error so we convert/format them to datetime in other to calculate the time difference.
FireBrigade['TOC'] = pd.to_datetime(FireBrigade['Date'] + ' ' + FireBrigade['TOC'])#coverting "TOC" to date time format.
FireBrigade['ORD'] = pd.to_datetime(FireBrigade['Date'] + ' ' + FireBrigade['ORD'])#Converting "ORD" to date time format
adf = FireBrigade['Date']
FireBrigade['Date'] =  pd.to_datetime(FireBrigade['Date'])
FireBrigade.head()

        Date  Station Area   Description  ...        AH       MAV        CD
0 2013-01-01   Rathfarnham     S/S OTHER  ...  02:28:54  02:48:54  03:08:54
1 2013-01-01      Tallaght      Fire CAR  ...  02:25:43  02:45:43  03:05:43
2 2013-01-01  North Strand       S/S RTA  ...  04:11:20  04:31:20  04:51:20
3 2013-01-01      Tallaght      Fire CAR  ...  04:50:48  05:10:48  05:30:48
4 2013-01-01       Finglas  Fire DOM PER  ...  04:50:47  05:10:47  05:30:47

[5 rows x 11 columns]

In [18]:
#Time difference between TOC and ORD
print(f"The time difference is:\n{min((FireBrigade['ORD'] - FireBrigade['TOC'])).seconds} seconds")

The time difference is:
30 seconds

## [14] Using the resulting data set, post implementing the previous cleansing steps, load the data into a table in SQL Server. (Note: you must create the physical table in SQL Server to complete this task. Use the same column names as the columns in the CSV File.)

In [19]:
#Formatting the remaining columns for upload into an SQLite database.
FireBrigade['MOB'] = pd.to_datetime(adf + ' ' + FireBrigade['MOB'])
FireBrigade['IA'] = pd.to_datetime(adf + ' ' + FireBrigade['IA'])
FireBrigade['LS'] = pd.to_datetime(adf + ' ' + FireBrigade['LS'])
FireBrigade['AH'] = pd.to_datetime(adf + ' ' + FireBrigade['AH'])
FireBrigade['MAV'] = pd.to_datetime(adf + ' ' + FireBrigade['MAV'])
FireBrigade['CD'] = pd.to_datetime(adf + ' ' + FireBrigade['CD'])
FireBrigade = FireBrigade.rename(columns = {'Station Area':'Station_Area'})
FireBrigade.head()

        Date  Station_Area  ...                 MAV                  CD
0 2013-01-01   Rathfarnham  ... 2013-01-01 02:48:54 2013-01-01 03:08:54
1 2013-01-01      Tallaght  ... 2013-01-01 02:45:43 2013-01-01 03:05:43
2 2013-01-01  North Strand  ... 2013-01-01 04:31:20 2013-01-01 04:51:20
3 2013-01-01      Tallaght  ... 2013-01-01 05:10:48 2013-01-01 05:30:48
4 2013-01-01       Finglas  ... 2013-01-01 05:10:47 2013-01-01 05:30:47

[5 rows x 11 columns]

#[a] Importing into SQLlite.

In [21]:
import sqlite3 as dd
##Creating/Connecting to a database
FireBrigadeAmbulance = dd.connect("FIreAndCallouts.db")
FireBrigadeAmbulance.execute("drop table if exists results")
try:
  #Creating new table
    FireBrigadeAmbulance.execute("create table FireAndCalloutsData(Date date, Station_Area text,Description text,TOC date,ORD date,MOB date,IA date, LS date,AH date,MAV date,CD date)")
except:
    print("Table is already created: ")

Table is already created:

#[b] Checking New table is created

In [22]:
for index, row in FireBrigade.iterrows():#looping throught all rows in new table.
  Ambulance = "insert into FireAndCalloutsData(Date, Station_Area,Description,TOC,ORD,MOB,IA,LS,AH,MAV,CD) values('{}','{}','{}','{}','{}','{}','{}','{}','{}','{}','{}')".format(row.Date, row.Station_Area, row.Description,row.TOC,row.ORD,row.MOB,row.IA,row.LS,row.AH,row.MAV,row.CD)
  FireBrigadeAmbulance.execute(Ambulance)#testing tables
FireBrigadeAmbulance.commit()
print("Record Sucessfully Added")

Record Sucessfully Added

In [23]:
Firesql = "Select * from FireAndCalloutsData"
Database_Data = pd.read_sql_query(Firesql, FireBrigadeAmbulance)
Database_Data.head()

                  Date  Station_Area  ...                  MAV                   CD
0  2013-01-01 00:00:00   Rathfarnham  ...  2013-01-01 02:48:54  2013-01-01 03:08:54
1  2013-01-01 00:00:00      Tallaght  ...  2013-01-01 02:45:43  2013-01-01 03:05:43
2  2013-01-01 00:00:00  North Strand  ...  2013-01-01 04:31:20  2013-01-01 04:51:20
3  2013-01-01 00:00:00      Tallaght  ...  2013-01-01 05:10:48  2013-01-01 05:30:48
4  2013-01-01 00:00:00       Finglas  ...  2013-01-01 05:10:47  2013-01-01 05:30:47

[5 rows x 11 columns]

In [24]:
Database_Data.dtypes

Date            object
Station_Area    object
Description     object
TOC             object
ORD             object
MOB             object
IA              object
LS              object
AH              object
MAV             object
CD              object
dtype: object